Tekla.Structures.DirectManipulation.Model.CreationCommands.RebarSetTypeProvider
The Tekla.Structures.DirectManipulation.Model.CreationCommands.RebarSetTypeProvider provides creation commands for different categories of rebar set.

Tekla.Structures.DirectManipulation.Model.CreationCommands.RebarSetTypeProvider.CrossingBeam
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating a crossing rebar set in a beam.

Tekla.Structures.DirectManipulation.Model.CreationCommands.RebarSetTypeProvider.LongitudinalBeam
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating a longitudinal rebar set in a beam.

Tekla.Structures.DirectManipulation.Model.CreationCommands.RebarSetTypeProvider.Slab
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating a rebar set in a slab or wall.

Tekla.Structures.DirectManipulation.Model.CreationCommands.RebarSetTypeProvider.Surface
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating a rebar set on a complex surface.

Tekla.Structures.DirectManipulation.Model.CreationCommands.RebarSetTypeProvider.PointInput
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating a rebar set via point input.